trunk/mts/test/TestMobility/BOUCHONS/Bouchon_Enabler_SIP_Scen_2.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Related XMLSchema file: conf/schemas/scenario.xsd -->

<!-- Pense bete SWE
non interpretation XML de inferieur par    &lt;
non interpretation XML de superieur par    &gt;
-->

<!DOCTYPE library [
<!ENTITY libS_Proxy_Server			SYSTEM "..\library\Bouchon_Proxy_Server.xml">
<!ENTITY libS_Own_Invite				SYSTEM "..\library\Bouchon_Own_Invite.xml">
]>

<scenario>

<parameter name="[provider_Name]" operation="set" value="[scenarioName]"/>
<parameter name="[provider_IP]" operation="set" value="[Host-Server]"/>
<parameter name="[provider_Port]" operation="set" value="[Port-Enabler]"/>
<openProviderSIP name="open SIP provider" providerName="[provider_Name]" localHost="[Host-Enabler]" localPort="[provider_Port]" transport="UDP"/>

<!--
Semaphore Synchro fin de phase d'initialisation
-->
<parameter name="[test:FIN_Init_Loader_vers_Bouchon]" operation="semaphore.wait" value="1" value2="0"/>


<parameter name="[newRoute_IP]" operation="set" value="[Host-Tester]"/>
<parameter name="[newRoute_Port]" operation="set" value="[Port-Subs_B]"/>
<parameter name="[called_Subscriber]" operation="set" value="OWN_CALL_0_MFR_A"/>
<parameter name="[expected_Scenario]" operation="set" value="PROXY"/>

<!-- Proxy de l'INVITE -->
<log level="1"> PROXY_THE_INVITE </log>
&libS_Proxy_Server;
<!-- Filtrage du 100 - SWESWE a confirmer -->
<log level="1"> NOT_PROXY_THE_100 </log>
&libS_Proxy_Server;
<!-- Proxy du 180 -->
<log level="1"> PROXY_THE_180 </log>
&libS_Proxy_Server;
<!-- Proxy du 200 ok -->
<log level="1"> PROXY_THE_200 </log>
&libS_Proxy_Server;
<!-- Proxy du ACK -->
<log level="1"> PROXY_THE_ACK </log>
&libS_Proxy_Server;


<openConnectionHTTP connectionName="Notification_to_AS" localHost="[Host-Enabler]" remoteURL="http://[Host-Tester]:[Port-AS]"/> 
    	                	        	        
<sendRequestHTTP name="Send POST" server="http://[Host-Tester]:[Port-AS]" delay="0">

<![CDATA[
POST /mockCallNotification HTTP/1.1
Content-Type: text/xml; charset=UTF-8
SOAPAction: ""
Accept: *
User-Agent: XMLLoader
Host: [Host-Tester]
Connection: Keep-Alive
Content-Length: x

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body><ns2:notifyCallEvent xmlns:ns2="http://www.csapi.org/schema/parlayx/call_notification/v3_2/local">
<ns2:correlator>toto2</ns2:correlator>
<ns2:eventNotified><CallEvent>Answer</CallEvent><Description>no description</Description></ns2:eventNotified>
<ns2:callingParticipant>sip:33975630254@10.194.124.162</ns2:callingParticipant>
<ns2:callingTerminal></ns2:callingTerminal><ns2:callingParticipantName></ns2:callingParticipantName>
<ns2:calledParticipant>sip:33975630255@10.194.124.162</ns2:calledParticipant>
<ns2:calledTerminal></ns2:calledTerminal>
<ns2:callSessionIdentifier>app-1qp6q7godwsq9|CALL_ID13_00D0E90206BE_T205963172@10.194.124.215|7265350063ccdfc3</ns2:callSessionIdentifier>
</ns2:notifyCallEvent>
</soap:Body>
</soap:Envelope>
]]>
	
</sendRequestHTTP>

<receiveResponseHTTP result="200" timeout="5"/>


<!--
SWESWE Nv comportement
-->

<!--
AddCallTerminalReq envoye par l'AS puis recu par la section Test local du meme AS
AddCallTerminalResp non traite
-->

<!--
SWESWE Envoi Own INVITE cvers Subs_A
-->

<parameter name="[newBranchId]" operation="identifier" value="newString" value2="10"/>
<parameter name="[newRoute_IP]" operation="set" value="[Host-Tester]"/>
<parameter name="[newRoute_Port]" operation="set" value="[Port-Subs_A]"/>
<parameter name="[called_Subscriber]" operation="set" value="OWN_Subs_A"/>

<parameter name="[newFirstLine]" operation="set" value="INVITE sip:10.194.124.26:6060 SIP/2.0"/>
<parameter name="[newTo]" operation="set" value="To: User_975630045 &lt;sip:+33975630045@sip.pfdev.fr;user=phone&gt;;tag=1"/>
<parameter name="[newFrom]" operation="set" value="From: &lt;sip:0975630046@sip.pfdev.fr;user=phone&gt;;tag=fa45bc38"/>
<parameter name="[Bouffe_180_200_puis_ACK]" operation="set" value="TRUE"/>
<parameter name="[ContentLength]" operation="set" value="0"/>

&libS_Own_Invite;

<!--
SWESWE Envoi Own INVITE vers Subs_A_TV
-->

<parameter name="[newBranchId]" operation="identifier" value="newString" value2="10"/>
<parameter name="[newRoute_IP]" operation="set" value="[Host-Tester]"/>
<parameter name="[newRoute_Port]" operation="set" value="[Port-Subs_A_TV]"/>
<parameter name="[called_Subscriber]" operation="set" value="OWN_TV_A"/>

<parameter name="[newFirstLine]" operation="set" value="INVITE sip:10.194.124.26:6060 SIP/2.0"/>
<parameter name="[newTo]" operation="set" value="To: User_975630045 &lt;sip:+33975630045@sip.pfdev.fr;user=phone&gt;;tag=1"/>
<parameter name="[newFrom]" operation="set" value="From: &lt;sip:0975630046@sip.pfdev.fr;user=phone&gt;;tag=fa45bc38"/>
<parameter name="[Bouffe_180_200_puis_ACK]" operation="set" value="TRUE"/>
<parameter name="[ContentLength]" operation="set" value="0"/>

&libS_Own_Invite;

<!--
SWESWE Envoi Own INVITE vers Subs_B
-->

<parameter name="[newBranchId]" operation="identifier" value="newString" value2="10"/>

<parameter name="[newRoute_IP]" operation="set" value="[Host-Tester]"/>
<parameter name="[newRoute_Port]" operation="set" value="[Port-Subs_B]"/>
<parameter name="[called_Subscriber]" operation="set" value="OWN_Subs_B"/>

<parameter name="[newFirstLine]" operation="set" value="INVITE sip:10.194.124.26:6090;transport=UDP SIP/2.0"/>
<parameter name="[newTo]" operation="set" value="To: &lt;sip:0975630046@sip.pfdev.fr;user=phone&gt;"/>
<parameter name="[newFrom]" operation="set" value="From: User_975630045 &lt;sip:+33975630045@sip.pfdev.fr;user=phone&gt;;tag=be996561"/>
<parameter name="[Bouffe_180_200_puis_ACK]" operation="set" value="TRUE"/>

&libS_Own_Invite;




<!-- Proxy du BYE -->
<log level="1"> PROXY_THE_BYE </log>
&libS_Proxy_Server;
<log level="1"> PROXY_THE_200ok_du_BYE </log>
&libS_Proxy_Server;


<!--



BYE envoye vers Subs_A_TV


-->

<parameter name="[newRoute_IP]" operation="set" value="[Host-Tester]"/>
<parameter name="[newRoute_Port]" operation="set" value="[Port-Subs_A_TV]"/>
<parameter name="[called_Subscriber]" operation="set" value="OWN_BYE_TV_A"/>

<sendRequestSIP name="Send BYE" providerName="[provider_Name]">
    	
<![CDATA[BYE sip:10.194.124.26:6090;transport=UDP SIP/2.0
To: <sip:dialog@10.194.124.26:6080>;tag=1
From: <sip:StopSecretAS@sip.pfdev.fr>;tag=7ed7962e
Call-ID: [lastCallId]
CSeq: [newCseqNumber] BYE
Via: SIP/2.0/UDP [Host-Enabler]:[provider_Port];branch=z9hG4bK[newBranchId]
Route: <sip:[called_Subscriber]@[newRoute_IP]:[newRoute_Port];lr>
Contact: <sip:[Host-Tester]:[provider_Port]>
Max-Forwards: 70
User-Agent: XMLLoader
Content-Length: 0
]]></sendRequestSIP>

<receiveResponseSIP name="Wait 200 OK" providerName="[provider_Name]" method="BYE" result="200">
</receiveResponseSIP>


<sendRequestHTTP name="Send POST" server="http://[Host-Tester]:[Port-AS]" delay="0">

<![CDATA[
POST /mockCallNotification HTTP/1.1
Content-Type: text/xml; charset=UTF-8
SOAPAction: ""
Accept: *
User-Agent: XMLLoader
Host: [Host-Tester]
Connection: Keep-Alive
Content-Length: x

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body><ns2:notifyCallEvent xmlns:ns2="http://www.csapi.org/schema/parlayx/call_notification/v3_2/local">
<ns2:correlator>toto2</ns2:correlator>
<ns2:eventNotified><CallEvent>CalledNumber</CallEvent><Description>no description</Description></ns2:eventNotified>
<ns2:callingParticipant>sip:33975630254@10.194.124.162</ns2:callingParticipant>
<ns2:callingTerminal></ns2:callingTerminal><ns2:callingParticipantName></ns2:callingParticipantName>
<ns2:calledParticipant>sip:33975630255@10.194.124.162</ns2:calledParticipant>
<ns2:calledTerminal></ns2:calledTerminal>
<ns2:callSessionIdentifier>app-1qp6q7godwsq9|CALL_ID13_00D0E90206BE_T205963172@10.194.124.215|7265350063ccdfc3</ns2:callSessionIdentifier>
</ns2:notifyCallEvent>
</soap:Body>
</soap:Envelope>
]]>
	
</sendRequestHTTP>

<receiveResponseHTTP result="200" timeout="5"/>

<closeConnectionHTTP connectionName="Notification_to_AS"/>

<closeProviderSIP name="close SIP provider" providerName="[provider_Name]"/>

</scenario>
